app/controllers/abcs_controller.rb

SELECT count(*) AS count_all FROM "abcs"
---
  def index
    respond_to do |format|
      format.html     # index.html.erb (no data required)
      format.ext_json { render :json => @abcs.to_ext_json(:class => Abc, :count => Abc.count(options_from_search(Abc))) }

INSERT INTO "abcs" ("updated_at", "title", "created_at") VALUES('2010-05-07 11:47:36', 'abc', '2010-05-07 11:47:36')
---
  def create
    @abc = Abc.new(params[:abc])
    render :json => @abc.to_ext_json(:success => @abc.save)