app/controllers/accounts_controller.rb

SELECT * FROM "accounts" WHERE ("accounts"."id" = 1)
---
  def show
    @account = Account.find(params[:id])

SELECT * FROM "accounts" WHERE ("accounts"."id" = 1)
---
  def edit
    @account = Account.find(params[:id])

INSERT INTO "accounts" ("name", "updated_at", "account_group_id", "created_at") VALUES('aaa', '2009-05-07 10:15:08', NULL, '2009-05-07 10:15:08')
---
  def create
    @account = Account.new(params[:account])


    respond_to do |format|
      if @account.save

SELECT * FROM "accounts" WHERE ("accounts"."id" = 1)
---
  def update
    @account = Account.find(params[:id])

SELECT * FROM "accounts" WHERE ("accounts"."id" = 1)
DELETE FROM "accounts" WHERE "id" = 1
---
  def destroy
    @account = Account.find(params[:id])
    @account.destroy