app/controllers/account_groups_controller.rb

SELECT * FROM "account_groups"
---
  def index
    @account_groups = AccountGroup.all

SELECT * FROM "account_groups" WHERE ("account_groups"."id" = 1)
---
  def show
    @account_group = AccountGroup.find(params[:id])

INSERT INTO "account_groups" ("name", "updated_at", "created_at") VALUES('ankur', '2010-05-05 08:21:35', '2010-05-05 08:21:35')
---
  def create
    @account_group = AccountGroup.new(params[:account_group])

    respond_to do |format|
      if @account_group.save